[
  {
    "id": "1",
    "name": "The OpenxAI Genesis",
    "description": "## Overview\n\nThe OpenxAI Genesis marks the official launch of the OpenxAI initiative, establishing the foundation for protocol development, governance, and ecosystem integration. This milestone includes the deployment of OpenxAI Studio, seamless aggregation and integration of open-source AI models, and the implementation of Xnode and bare-metal infrastructure to power decentralized AI computation. Additionally, it involves the creation of Genesis user dashboards, the activation of OpenxAIDAO for decentralized governance, and the setup of funding mechanisms, incentive structures, and community engagement strategies. The deployment of initial smart contracts ensures transparency, security, and automation in the network's operations, solidifying OpenxAI as a fully decentralized AI ecosystem.\n\n## Scope of Work\n- Deployment of the OpenxAI fundraising smart contract, enabling milestone-based funding and automated disbursements.\n- Setup and auditing of wallet infrastructure, ensuring secure fund allocations and efficient financial operations.\n- Deployment of OpenxAI Studio, providing an intuitive interface for AI model execution, compute resource management, and analytics.\n- Integration of open-source AI models, allowing developers to access and contribute to decentralized AI solutions.\n- Development of a public-facing dashboard, displaying real-time fund allocations, infrastructure health, and milestone progress.\n- Activation of OpenxAI DAO (OpexAIDAO) for decentralized governance, ensuring transparent decision-making.\n- Establishment of funding mechanisms, incentive structures, and community engagement strategies to drive ecosystem participation.\n- By integrating Xnode, Xnode Studio, and bare-metal compute infrastructure, OpenxAI will provide a scalable, secure, and decentralized AI environment, enabling contributors to develop, deploy, and monetize AI models with full transparency and governance oversight.",
    "fundingGoal": "15000",
    "deadline": "2025-03-10",
    "backersRewards": "550030",
    "flashBonus": "120000",
    "rewardAPY": "76.50",
    "status": "Pending",
    "escrow": "0x"
  },
  {
    "id": "2",
    "name": "OpenxAI Decentralized Infrastructure Fund (Q1)",
    "description": "## Overview\n\nThe OpenxAI Decentralized Infrastructure Fund, powered by Openmesh Xnode, establishes the core infrastructure for decentralized AI compute, storage, and networking. Xnode, a decentralized virtual machine similar to AWS EC2, eliminates reliance on centralized cloud providers by leveraging Openmesh's bare-metal and cloud-independent architecture. This ensures permissionless, scalable, and distributed computing, allowing AI models to execute seamlessly across a global network of independent nodes. AI without censorship. Your AI. Your Rules. No Middlemen.\n\nXnode dynamically provisions compute resources, optimizes workload distribution, and ensures high availability for AI developers and researchers. Unlike traditional cloud-based AI execution, it provides censorship-resistant, cost-efficient, and fully decentralized AI computation, making OpenxAI independent from corporate cloud monopolies.\n\nDeploying and maintaining this infrastructure requires compute node deployment, network load balancing, security hardening, and AI model execution automation to ensure reliability and scalability.\n\n## Scope of Work\n- Aggregate the most powerful open source AI models and integrate into OpenxAI Studio.\n- Deploy and configure Xnode-powered compute clusters across Openmesh's decentralized infrastructure to support AI data sets and model training workloads.\n- Set up decentralized storage infrastructure to facilitate AI data availability, ensuring that datasets and model artifacts are distributed securely and redundantly across the network.\n- Develop and integrate automated resource allocation algorithms to optimize compute scheduling and efficiently allocate workloads based on demand and node availability.\n- Implement security protocols and failover mechanisms to prevent data loss, secure model execution, and maintain 99.9% uptime across AI workloads.\n- Conduct performance benchmarking and stress testing to validate system stability, ensuring OpenxAI can support high-intensity AI computations in real-world scenarios.\n- Optimize GPU-based AI execution pipelines for decentralized environments, enabling seamless data processing and AI model training across Openmesh's compute network.",
    "fundingGoal": "30000",
    "deadline": "2025-03-15",
    "backersRewards": "1087678",
    "flashBonus": "240000",
    "rewardAPY": "70.30",
    "status": "Pending",
    "escrow": "0x"
  },
  {
    "id": "3",
    "name": "Milestone Based Fair Launch on Uniswap & Liquidity Setup",
    "description": "## Overview\n\nMilestone-Based Fair Launch, TGE & Uniswap Setup is a structured token distribution model similar to Kickstarter, ensuring that funds are allocated transparently and responsibly based on achievable project milestones rather than speculative hype. Unlike traditional token launches (ICOs, IDOs, INOs) where funds are raised upfront without accountability, this methodology ties funding releases directly to project progress through smart contracts, verified by the community, ensuring that funds are escrowed using smart contracts and deployed only when milestones are met.\n\n$20,000 worth of USDC, USDT, or WETH will be allocated to deploy Uniswap liquidity pools and configure trading parameters.\n\nEach milestone is listed on the OpenxAI fundraising page, allowing backers to contribute using ETH, USDC, USDT, or WETH. Backers can claim OPENX tokens only when a milestone is successfully reached. When the community vote confirms a milestone is achieved, funds are released to the appropriate team(s) or executor, along with a flash reward for milestone completion. If a milestone fails, backers' funds are returned, along with 1 OPENX per $1 contributed as an appreciation reward for participation.\n\nSince backers can only claim their tokens upon milestone completion, they are incentivized to stay actively engaged in the community rather than simply funding a project and moving on. This approach prevents bad actors and malicious activities by ensuring funding is tied to actual progress fostering a collaborative environment where backers and builders work together to ensure success. The OpenxAI DAO has dispute mechanisms and a veto voting system to prevent abuse and uphold fairness in fund distribution.\n\n## Basics\n- Funds are locked in smart contracts and released only when predefined milestones are met.\n- Each milestone is publicly listed with clear objectives and funding details.\n- Funds are publicly tracked and verified, ensuring full transparency.\n- Backers use ETH, USDC, USDT, or WETH and can only claim their OPENX tokens when a milestone is confirmed.\n- Risk Mitigation for Backers – If a milestone fails, funds are refunded, with 1 OPENX per $1 contributed as an appreciation bonus.\n\n## Scope of Work\n- Deploy Uniswap liquidity pools and configure trading parameters.\n- Implement smart contract mechanisms to enforce milestone-based fund releases.\n- Develop a real-time fundraising dashboard for tracking milestone progress and fund disbursement.\n- Enforce tiered funding limits to prevent concentration of token ownership.\n- Establish secure token claim mechanisms to ensure rewards are distributed only upon milestone completion.\n- Conduct smart contract security audits to prevent vulnerabilities and ensure fair execution.",
    "fundingGoal": "20000",
    "deadline": "2025-03-14",
    "backersRewards": "716862",
    "flashBonus": "160000",
    "rewardAPY": "64.52",
    "status": "Pending",
    "escrow": "0x"
  },
  {
    "id": "4",
    "name": "Launch OpenxAIDAO & Governance",
    "description": "## Overview\n\nA Decentralized Autonomous Organization (DAO) is a self-governing system where decisions are made collectively by its members rather than a central authority. DAOs leverage smart contracts to automate governance, execute treasury management, and enforce transparent decision-making processes. OpenxAIDAO is the core governance entity of OpenxAI, responsible for managing funding allocations, setting development priorities, and overseeing ecosystem expansion. It ensures that decision-making is fully decentralized, transparent, and community-driven by leveraging on-chain smart contracts and token-based voting mechanisms.\n\nOpenxAIDAO is built using AragonDAO modules, customized by the Openmesh team to fit the specific needs of OpenxAI. This integration provides a robust and scalable governance infrastructure, enabling efficient proposal execution, decentralized treasury management, and seamless community participation. Special thanks to AragonDAO for its foundational framework, which has been adapted to align with OpenxAI's decentralized governance vision.\n\nGovernance participants include OPENX token holders and Verified Contributor NFT holders, who can submit and vote on proposals that shape OpenxAI's future. OpenxAIDAO ensures equitable participation, preventing governance centralization and securing treasury funds through automated smart contract execution.\n\nThe governance framework consists of proposal submissions, quadratic voting, veto rights, and treasury management tools, ensuring that fund distribution follows clear, community-approved milestones. Treasury allocations are only released upon successful project execution, creating accountability and minimizing risk. The governance model also includes dispute resolution mechanisms, preventing abuse while upholding fair and secure decision-making.\n\nThe core purpose of OpenxAIDAO:\n- Power is distributed among token holders, preventing centralized control.\n- Treasury allocations are governed by community-approved smart contracts, ensuring accountability.\n- Members propose, vote on, and fund initiatives that align with the ecosystem's growth.\n- Smart contracts execute governance decisions without intermediaries, reducing inefficiencies and risks.\n- Governance mechanisms, including veto rights and structured proposal evaluation, prevent misuse of funds.\n\n## How It Works\n- Token holders and Verified Contributor NFT holders can propose funding allocations, development initiatives, and strategic partnerships.\n- Quadratic Voting & Veto System. A weighted voting system ensures that decision-making power is balanced, preventing governance centralization.\n- Treasury-Controlled Smart Contracts. Funds are only disbursed when milestone-based funding requirements are met and validated by the DAO.\n- A transparent interface for proposal tracking, voting history, and funding approvals.\n- Dispute Resolution Mechanisms. A structured governance process to resolve conflicts, preventing misuse of treasury funds.\n\n## Scope of Work\n- Deploy OpenxAIDAO smart contracts to facilitate decentralized governance operations.\n- Implement quadratic voting, veto mechanisms, and proposal execution frameworks.\n- Integrate OpenxAIDAO modules into the user dashboard.\n- Develop a governance dashboard with real-time proposal tracking and funding status.\n- Integrate multi-signature security for treasury management and fund disbursement controls.\n- Conduct security audits on governance contracts to prevent vulnerabilities and unauthorized actions.\n- Establish a community onboarding framework to educate new participants about governance roles and responsibilities.",
    "fundingGoal": "5000",
    "deadline": "2025-03-10",
    "backersRewards": "177151",
    "flashBonus": "40000",
    "rewardAPY": "59.11",
    "status": "Pending",
    "escrow": "0x"
  },
  {
    "id": "5",
    "name": "Community Bounties",
    "description": "## Overview\n\nIncentivizes early adopters, developers, and community members by rewarding contributions to OpenxAI. Tasks include technical development, content creation, outreach, and enhancing community resources.\n\nParticipants will have the opportunity to collaborate on key OpenxAI initiatives, contributing to community growth, refining engagement strategies, expanding educational resources, and increasing global awareness. Rewards will be distributed based on impact, quality, and successful task completion, ensuring that meaningful contributions are fairly recognized and compensated.\n\n## Scope of Work\n- Establish a bounty system covering technical and non-technical contributions.\n- Launch five bounty categories with structured rewards.\n- Set up submission and verification processes for bounty claims.",
    "fundingGoal": "5000",
    "deadline": "2025-03-31",
    "backersRewards": "175087",
    "flashBonus": "40000",
    "rewardAPY": "54.05",
    "status": "Pending",
    "escrow": "0x"
  },
  {
    "id": "6",
    "name": "Protocol Operations (March)",
    "description": "## Overview\n\nThe core team has already spent over $18,000 this month to launch the project. These funds will cover the remaining essential operational expenses for OpenxAI in March, ensuring the continuity of infrastructure, community initiatives, and ecosystem engagement. This includes maintaining core operations, supporting key community-driven initiatives, collaborating with strategic stakeholders, and ensuring infrastructure stability and service availability. These resources represent the minimum required to sustain OpenxAI's operations, with core contributors compensated through DAO-approved incentives.\n\n## Scope of Work\n- Maintain core operations to ensure uninterrupted infrastructure, governance, and development processes.\n- Support community-driven initiatives by funding and facilitating programs that enhance engagement, education, and outreach.\n- Collaborate with key stakeholders, including ecosystem partners, investors, and developers, to drive adoption and integration.\n- Ensure infrastructure stability by maintaining network uptime, security, and operational efficiency across all critical services.\n- Provide essential services availability, ensuring seamless functionality for users and contributors.",
    "fundingGoal": "8000",
    "deadline": "2025-03-31",
    "backersRewards": "276837",
    "flashBonus": "64000",
    "rewardAPY": "49.31",
    "status": "Pending",
    "escrow": "0x"
  },
  {
    "id": "7",
    "name": "100 Videos, 100 Articles, 10 Days",
    "description": "## Overview\n\nA large-scale content initiative aimed at educating, onboarding, and increasing awareness of OpenxAI across Web3, AI, and developer communities. The campaign will produce technical guides, benchmark testing, thought leadership articles, explainer videos, tutorials, deep-dive research papers, case studies, social media content, and community AMAs. The funds will be distributed to content creators around the world.\n\n## Scope of Work\n- Publish 100 high-quality articles covering OpenxAI's use cases, integrations, and industry positioning.\n- Produce 100 engaging videos, including technical walkthroughs, ecosystem updates, AMA sessions, and interviews with key stakeholders.\n- Create comprehensive benchmark reports showcasing OpenxAI's performance against centralized AI infrastructure.\n- Develop detailed tutorials and developer guides for onboarding new contributors and users.\n- Publish deep-dive research papers and case studies analyzing the impact of decentralized AI solutions.\n- Design infographics, visual explainers, and social media assets for easy content distribution across various platforms.\n- Host community-driven discussions and AMAs with developers, researchers, and thought leaders to drive engagement.\n- Implement a structured content distribution strategy, ensuring materials reach Web3, AI, and developer audiences through blogs, newsletters, and media partnerships.",
    "fundingGoal": "25000",
    "deadline": "2025-03-10",
    "backersRewards": "854798",
    "flashBonus": "200000",
    "rewardAPY": "44.84",
    "status": "Pending",
    "escrow": "0x"
  },
  {
    "id": "8",
    "name": "Community Ambassador Program",
    "description": "## Overview\n\nAmbassadors play a vital role in raising awareness, driving adoption, and supporting new community members. The OpenxAI Ambassador Program is designed to attract passionate and talented individuals who align with OpenxAI's vision. By engaging a network of influencers, educators, developers, and community leaders, ambassadors will be instrumental in expanding OpenxAI's presence across Web3, AI, and developer ecosystems.\n\nTo ensure impact and accountability, vetted ambassadors will receive ETH, USDT, and USDC allocations based on clearly defined KPIs and performance metrics. This initiative establishes a structured engagement model, providing ambassadors with the necessary support, resources, and incentives to contribute meaningfully to OpenxAI's growth.\n\nSelected ambassadors will gain exclusive access to OpenxAI resources, early product updates, and priority participation in governance and ecosystem initiatives.\n\n## Scope of Work\n- Onboard 15–20 ambassadors with a proven track record in Web3, AI, and developer advocacy.\n- Develop a structured engagement strategy with tiered incentive models based on impact, outreach, and contributions.\n- Provide educational resources, documentation, and community tools to empower ambassadors in spreading awareness.\n- Host monthly community calls, AMAs, and outreach programs to drive engagement and address community questions.\n- Organize localized meetups, virtual hackathons, and collaborative awareness campaigns to expand OpenxAI's reach.\n- Implement performance tracking and reporting mechanisms to measure ambassador contributions and impact.\n- Facilitate cross-community collaborations, connecting OpenxAI with developer networks, AI forums, and blockchain communities.\n- Reward top-performing ambassadors with token incentives, ecosystem perks, and governance participation rights.",
    "fundingGoal": "5000",
    "deadline": "2025-03-30",
    "backersRewards": "168895",
    "flashBonus": "40000",
    "rewardAPY": "40.64",
    "status": "Pending",
    "escrow": "0x"
  },
  {
    "id": "9",
    "name": "30 Devs in 30 Days Campaign",
    "description": "## Overview\n\nThis initiative is designed to onboard 30 top-tier AI and Web3 developers from around the world in just 30 days, establishing a strong foundation of contributors focused on protocol enhancements, integrations, and tooling. While open-source contributions are valuable, this program aims to push engagement to the next level by fostering deep, hands-on involvement.\n\nTo support this effort, OpenxAIDAO will allocate a substantial portion of its R&D treasury—alongside stablecoins—to reward and incentivize newly onboarded developers. Participants will benefit from a structured onboarding process, incentives, and real-world project work, accelerating their integration into the OpenxAI ecosystem.\n\nThese developers will also have the opportunity to showcase cutting-edge technologies and AI innovations, further positioning OpenxAI at the forefront of the industry. To ensure a balance between accountability and innovation, the OpenxAIDAO community and protocol governance will oversee the initiative through DAO voting and OpenR&D mechanisms. This governance structure ensures alignment with OpenxAI's long-term vision and goals while maintaining transparency and engagement.\n\nAll current and future core contributors will operate within a structured framework that defines roles, accountability, incentives, and rewards, ensuring long-term sustainability and success for the OpenxAI ecosystem.\n\n## Scope of Work\n- Conduct a targeted recruitment campaign across AI/Web3 developer communities.\n- Onboard 30 AI/Web3 developers in 30 days from top communities and hackathons.\n- Provide technical onboarding sessions and mentorship for new developers.\n- Provide structured onboarding, mentorship, and clear contribution guidelines.\n- Assign high-impact projects focused on protocol enhancements and integrations.\n- Allocate stablecoins and treasury tokens as incentives based on performance.\n- Enable developer showcases and participation in OpenxAIDAO governance.\n- Assign structured development tasks to integrate new contributors effectively.\n- Track contributions, ensure accountability, and align with long-term goals.",
    "fundingGoal": "10000",
    "deadline": "2025-04-15",
    "backersRewards": "333663",
    "flashBonus": "80000",
    "rewardAPY": "36.67",
    "status": "Pending",
    "escrow": "0x"
  }
]